Autodesk.Revit.DB.Transform2D.TransformUVDomainIfPossible(Autodesk.Revit.DB.BoundingBoxUV)
Transforms an envelope (Autodesk.Revit.DB.BoundingBoxUV) for one surface to an envelope for a coincident but differently parameterized surface.
Remarks:
This method succeeds in the case when the uv-parameter transform between the surfaces
has a simple form, that commonly occurs for analytic surfaces,
such that the image of the input envelope under the transform
is itself a rectangular region aligned with the UV coordinate axes.
uvDomain:
The original surface envelope.
Returns:
If successful a new Autodesk.Revit.DB.BoundingBoxUV transformed surface envelope, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
uvDomain is not set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.GetInverse
Gets the inverse transformation of this transformation.
Remarks:
The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This transformation is not conformal or invertible.
Since:
2021

Autodesk.Revit.DB.Transform2D.PostScale(System.Double)
Scales both the linear and translational parts of this transformation and returns the result.
Remarks:
The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.
scale:
The scale value.
Returns:
Returns a pointer to "this" Autodesk.Revit.DB.Transform2D.
Since:
2021

Autodesk.Revit.DB.Transform2D.PreScale(System.Double)
Scales the linear part of this transformation and returns the result.
Remarks:
The resulting transformation is equivalent to the application of the uniform scale and then this transformation, in this order.
scale:
The scale value.
Returns:
Returns a pointer to "this" Autodesk.Revit.DB.Transform2D.
Since:
2021

Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV)
Applies the transformation to the vector and returns the result.
Remarks:
Transformation of a vector is not affected by the translational part of the transformation.
vector:
The vector to transform.
Returns:
The transformed vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.OfPoint(Autodesk.Revit.DB.UV)
Applies the transformation to the point and returns the result.
Remarks:
Transformation of a point is affected by the translational part of the transformation.
point:
The point to transform.
Returns:
The transformed point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.Multiply(Autodesk.Revit.DB.Transform2D)
Multiplies this transformation by the specified transformation and returns the result.
Remarks:
The combined transformation has the same effect as applying the right transformation first, and this transformation, second.
So, denoting this transform by T1 and the right transform by T2, (T1(T2(p)) = (T1 * T2) (p).
Returns:
The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.CreateIdentity
Creates the identity transformation.
Remarks:
The identity transformation does not change a point or a vector that it is applied to.
Returns:
The identity transformation.
Since:
2021

Autodesk.Revit.DB.Transform2D.SetToIdentity
Set this TrfUV to the identity transform.
Returns:
Returns a pointer to "this" Autodesk.Revit.DB.Transform2D.
Since:
2021

Autodesk.Revit.DB.Transform2D.Assign(Autodesk.Revit.DB.Transform2D)
Assigns values from the input transformation to this transformation.
from:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.AlmostEqual(Autodesk.Revit.DB.Transform2D)
Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Remarks:
The tolerance is applied memberwise for comparison.
right:
The transformation to compare with this transformation.
Returns:
True if the two transformations are equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Transform2D.Scale
The real number that represents the scale of the conformal transformation.
Remarks:
When the transformation is conformal and can be decomposed as the product of a rigid-body motion,
uniform scale and reflection, this property returns the scale value of the uniform scale transformation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This transformation is not conformal and the scale is undefined.
Since:
2021

Autodesk.Revit.DB.Transform2D.HasReflection
The boolean value that indicates whether this transformation produces reflection (i.e., is orientation-reversing).
Remarks:
Reflection transformation changes the handedness of a coordinate system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This transformation is singular and the reflection is undefined.
Since:
2021

Autodesk.Revit.DB.Transform2D.BasisV
The image of (0, 1) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.BasisU
The image of (1, 0) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.Determinant
The determinant of this transformation.
Remarks:
The geometric meaning of a determinant is as the scale factor for volume when applied as linear transformation.
Since:
2021

Autodesk.Revit.DB.Transform2D.IsConformal
The boolean value that indicates whether this transformation is conformal.
Remarks:
This property is true if this transformation can be decomposed as the product
of a rigid-body motion, uniform scale and reflection.
Such transformation preserves angles between vectors.
Since:
2021

Autodesk.Revit.DB.Transform2D.IsTranslation
The boolean value that indicates whether this transformation is a translation.
Remarks:
This property is true if the only effect of transformation is translation.
It checks that the linear part of the transform is identity. The translation vector may be zero
(which would make this an identity transformation) or nonzero (which would make this a non-trivial translation).
Since:
2021

Autodesk.Revit.DB.Transform2D.IsIdentity
The boolean value that indicates whether this transformation is an identity.
Remarks:
The identity transformation does not change a point or a vector that it is applied to.
Since:
2021

Autodesk.Revit.DB.Transform2D.Origin
The image of (0, 0) under Autodesk.Revit.DB.Transform2D.OfPoint(Autodesk.Revit.DB.UV).
This defines the translational part of the transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.#ctor(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV)
Constructs the transformation by specifying the vectors and the origin.
uVec:
The image of (1, 0) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
vVec:
The image of (0, 1) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
origin:
The image of (0, 0) under Autodesk.Revit.DB.Transform2D.OfPoint(Autodesk.Revit.DB.UV).
This defines the translational part of the transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D.#ctor(Autodesk.Revit.DB.Transform2D)
The copy constructor.
other:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Transform2D
An affine transform of 2D Euclidean space.
Remarks:
An affine transform is a linear transform plus a translation (which may be zero).
Some functions only accept certain kinds of transform (e.g., rigid motion, conformal, non-singular, etc.).
Since:
2021